title: FortiManager FlatUI Upload Success
id: f182e2dc-3557-4cec-ac89-c437ec79b2a6
status: experimental
description: Upload Success via FlatUI on FortiManager
license: DRL-1.1
author: Synacktiv, Maxence Fossat [@cybiosity]
date: 2025-02-03
modified: 2025-02-03
tags:
    - tlp.clear
    - pap.clear
logsource:
    product: apache
    service: access
    definition: Apache access logs from FortiManager
detection:
    selection:
        cs-method: 'POST'
        cs-uri-stem|startswith: '/flatui/api/gui/upload'
        sc-status: 200
    condition: selection
level: informational