title: FortiManager Logout
id: 99a0e638-9046-49a1-b032-124051a1bbe7
status: experimental
description: User logout from FortiManager
license: DRL-1.1
author: Synacktiv, Maxence Fossat [@cybiosity]
date: 2025-02-03
modified: 2025-02-03
tags:
    - tlp.clear
    - pap.clear
logsource:
    product: apache
    service: access
    definition: Apache access logs from FortiManager
detection:
    selection:
        cs-method: 'GET'
        cs-uri-stem|startswith: '/p/logout'
        cs-uri-query|contains: 'host='
        sc-status: 200
    condition: selection
level: informational